In [16]:
import pandas as pd
import numpy as np
import seaborn as sns

# Make numpy values easier to read.
np.set_printoptions(precision=3, suppress=True)

import tensorflow as tf
from tensorflow.keras import layers

In [17]:
train = pd.read_csv("train.csv")
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [23]:
train["Embarked"].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [63]:
train = pd.read_csv("train.csv")

# Map female -> 0 and male -> 1
train["Sex"] = train["Sex"].map({"female": 0,
                                 "male": 1})

# In "Embarked" column there are {S:644, C:168, Q:77, NaN:2} so we map S -> 0, C -> 1, Q -> 2, NaN -> 0
embarked_map = {"S": 0,
              "C": 1,
              "Q": 2}

train["Embarked"] = train["Embarked"].map(embarked_map)
train.Embarked = train.Embarked.fillna(0)

# Remove categories that don't correspond to survival rate.
train = train.drop("PassengerId", axis=1)
train = train.drop("Name", axis=1)
train = train.drop("Ticket", axis=1)
train = train.drop("Cabin", axis=1)

# Put labels in their own dataframe
labels = train.pop("Survived")

train.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    1  22.0      1      0   7.2500       0.0
1       1    0  38.0      1      0  71.2833       1.0
2       3    0  26.0      0      0   7.9250       0.0
3       1    0  35.0      1      0  53.1000       0.0
4       3    1  35.0      0      0   8.0500       0.0

In [64]:
train.Age = (train.Age - train.Age.mean()) / train.Age.std()
train.Fare = (train.Fare - train.Fare.mean()) / train.Fare.std()
train.head()

   Pclass  Sex       Age  SibSp  Parch      Fare  Embarked
0       3    1 -0.530005      1      0 -0.502163       0.0
1       1    0  0.571430      1      0  0.786404       1.0
2       3    0 -0.254646      0      0 -0.488580       0.0
3       1    0  0.364911      1      0  0.420494       0.0
4       3    1  0.364911      0      0 -0.486064       0.0

In [ ]:
train_val = 

model = keras.Sequential([
    layers.Dense(4, activation="relu"),
    layers.Dense(4, activation="relu"),
    layers.Dense(1, activation="sigmoid")
])

model.compile(
    optimizer="rmsprop",
    loss="binary_crossentropy",
    metrics=["accuracy"]
)

history = model.fit(
    train,
    labels,
    epochs=10,
)